app/controllers/todoes_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = ? ORDER BY "goals"."id" DESC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "monsters".* FROM "monsters" WHERE "monsters"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."goal_id" = ? AND "tasks"."check" = ? LIMIT ?  [["goal_id", 1], ["check", 1], ["LIMIT", 11]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."goal_id" = ? LIMIT ?  [["goal_id", 3], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."goal_id" = ? LIMIT ?  [["goal_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "encourages"
SELECT "encourages".* FROM "encourages" WHERE "encourages"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def show
    @user = User.find(params[:id])
    @goal = @user.goals.last
    # @@goal = @user.goals.last #タスク完了にわたすため
    #初回は目標を設定させる
    if (@goal.nil?)
      redirect_to controller: 'todoes', action: 'new'
      return
    end
    if !(@goal.nil?)
      #@@current_goal_id = @goal.id
      @current_monster_id = @goal.monster_id
    end
    @monster = Monster.find(@current_monster_id)
    @task = Task.new
    # 完了、未完了タスク
    @get_check = Task.where(goal_id: @goal.id).where(check: true)
    @get_uncheck = Task.where(goal_id: @goal.id).where(check: false)
    # タスク完了、削除
    @check_task = Task.find_by(goal_id: @goal.id)
    @destroy_task = Task.find_by(goal_id: @goal.id)
    # モンスターコメント
    comment_max = Encourage.count;
    @comment = Encourage.find(rand(1..comment_max)).comment

SELECT COUNT(*) FROM "monsters"
INSERT INTO "goals" ("goal", "user_id", "monster_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["goal", "海賊王になる"], ["user_id", 3], ["monster_id", 2], ["created_at", "2020-10-26 17:29:39.744815"], ["updated_at", "2020-10-26 17:29:39.744815"]]
---
  def create
    @goal = Goal.new(goal_params)
    @goal.user_id = current_user.id
    monster_max = Monster.count
    @goal.monster_id = rand(1..monster_max)
    @goal.save

INSERT INTO "tasks" ("task", "goal_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["task", "ブログのネタを集める"], ["goal_id", 3], ["created_at", "2020-09-25 14:57:35.211920"], ["updated_at", "2020-09-25 14:57:35.211920"]]
---
  def task_create
    @task = Task.new(task_params)
    #@task.goal_id = @@current_goal_id
    #@task.goal_id = id_params
    @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "tasks" SET "check" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["check", 1], ["updated_at", "2020-10-27 00:33:14.056736"], ["id", 9]]
SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = ? ORDER BY "goals"."id" DESC LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
UPDATE "goals" SET "ex" = ?, "updated_at" = ? WHERE "goals"."id" = ?  [["ex", 10], ["updated_at", "2020-09-25 12:38:33.479292"], ["id", 1]]
UPDATE "goals" SET "ex" = ?, "updated_at" = ? WHERE "goals"."id" = ?  [["ex", 10], ["updated_at", "2020-10-27 00:33:14.069087"], ["id", 4]]
---
  def task_check
    @task = Task.find(params[:id])
    @task.update(check: true)
    #経験値追加
    @goal = current_user.goals.last
    @goal.increment(:ex , 10)
    @goal.save